In [1]:
import numpy as np
import pandas as pd

## Quiestion 1

#### I have built her  3 functions that take a number and switch it to a diffenrent base.
#### this function recives a number and casts it to a int by rounding down. than it prints the original int , the base we are changing it to, and what the nuber in the other base

In [2]:
def decimal_to_binary(dec):
    decimal=int(dec)
    print(decimal," in Binary: ",bin(decimal))  
    
def decimal_to_base8(dec):
    decimal=int(dec)
    print(decimal," in base8: ",oct(decimal))
    
def decimal_to_base16(dec):
    decimal=int(dec)
    print(decimal," in base16: ", hex(decimal))

In [3]:
dec=50.92546
decimal_to_binary(dec)

decimal_to_base8(dec)

decimal_to_base16(dec)

50  in Binary:  0b110010
50  in base8:  0o62
50  in base16:  0x32

In [4]:
dec=20
decimal_to_binary(dec)

decimal_to_base8(dec)

decimal_to_base16(dec)

20  in Binary:  0b10100
20  in base8:  0o24
20  in base16:  0x14

### Question 2
#### importing the data frame

In [13]:
cast=pd.read_csv(r"C:/Users/nechd\Desktop\cast.csv")
cast.head(10)

,title,year,name,type,character,n
0,Suuri illusioni,1985,Homo $,actor,Guests,22.0
1,Gangsta Rap: The Glockumentary,2007,Too $hort,actor,Himself,NaN
2,Menace II Society,1993,Too $hort,actor,Lew-Loc,27.0
3,Porndogs: The Adventures of Sadie,2009,Too $hort,actor,Bosco,3.0
4,Stop Pepper Palmer,2014,Too $hort,actor,Himself,NaN
5,Townbiz,2010,Too $hort,actor,Himself,NaN
6,For Thy Love 2,2009,Bee Moe $lim,actor,Thug 1,NaN
7,Desire (III),2014,Syaiful 'Ariffin,actor,Actor Playing Eteocles from 'Antigone',NaN
8,When the Man Went South,2014,Taipaleti 'Atu'ake,actor,Two Palms - Ua'i Paame,8.0
9,Little Angel (Angelita),2015,Michael 'babeepower' Viera,actor,Chico,9.0

### Question 2
#### part 1
 here we are making a new data frame that only contains movies with the title "Hamlet"
<br> than we take out all the rows that have the same title
<br> than we we print the shape to see how many rows are in this new data frame.
<br> lastly we print the amount of rows that the shape told us there were.

In [14]:
title_hamlet=cast.loc[cast['title']=='Hamlet']
title_hamlet_no_duplicates=title_hamlet.drop_duplicates(subset='year',keep ='first')
print(title_hamlet_no_duplicates.shape)
print("the amount of movies with the name hamlet are 17")

(17, 6)
the amount of movies with the name hamlet are 17

#### Question 2
#### part 2
 here we are making a new data frame that only contains movies with the title "Treasure Island"
<br> than we take out all the rows that have the same title
<br> than we make the data frame go in numerical order from the oldest movie to the newest
<br> lastly we print the data frame

In [15]:

Treasure_Island=cast.loc[cast['title']=='Treasure Island']
Treasure_Island_no_duplicicates=Treasure_Island.drop_duplicates(subset='year',keep ='first')
Treasure_Island_sorted=Treasure_Island_no_duplicicates.sort_values('year', ascending=True)
Treasure_Island_sorted

,title,year,name,type,character,n
313097,Treasure Island,1918,Francis Carpenter,actor,Jim Hawkins,1.0
345942,Treasure Island,1920,Lon Chaney,actor,Blind Pew,5.0
8570,Treasure Island,1934,Robert Adair,actor,Tom - Seaman,NaN
12141,Treasure Island,1950,Chris Adcock,actor,Pike,26.0
38151,Treasure Island,1972,Cristino Almod?var,actor,O'Brien,18.0
484325,Treasure Island,1973,Richard Dawson,actor,Long John Silver,1.0
14899,Treasure Island,1985,Yves Afonso,actor,French captain,8.0
104905,Treasure Island,1999,Lance (II) Baker,actor,Frank,1.0

#### Question 2
##### part 3
 using the data frame with all the movies with the name hamlet.
<br> we will make a new data frame with all the rows with the year 1921.
<br> than we will print the shape of the data frame.
<br> lastly we print the amount of rows that the shape told us there were.

In [16]:
hamlet_1921=title_hamlet.loc[title_hamlet['year']==1921]
print(hamlet_1921.shape)
print("the amount of roles credited in the movie hamlet from the year 1921 is 9")
hamlet_1921

(9, 6)
the amount of roles credited in the movie hamlet from the year 1921 is 9

          title  year                    name     type         character    n
6710     Hamlet  1921        Fritz Achterberg    actor       Fortinbras,  9.0
408456   Hamlet  1921            Paul Conradi    actor      K?nig Hamlet  2.0
495468   Hamlet  1921        Anton De Verdier    actor           Laertes  7.0
1015046  Hamlet  1921         Hans Junkermann    actor          Polonius  6.0
1948795  Hamlet  1921            Heinz Stieda    actor           Horatio  5.0
2116906  Hamlet  1921  Eduard von Winterstein    actor          Claudius  4.0
2370048  Hamlet  1921         Mathilde Brandt  actress  K?nigin Gertrude  3.0
2713980  Hamlet  1921          Lilly Jacobson  actress           Ophelia  8.0
2964897  Hamlet  1921            Asta Nielsen  actress            Hamlet  1.0

#### Question 2
##### part 4
 I took the data frame of hamlet that has only one row per movie.
<br> I grouped this data frame by the decade that the movie came out.
<br> I did that by telling it as it grouped to change each year that the movie came out to the lower full decade. I did that by taking the year and telling it to divide by 10 and forget the remainder and than timesby 10.
<br> After that i asked to see the size of each decade. that tells us how many hamlet movies were made per decade.

In [17]:
hamlet_decade=title_hamlet_no_duplicates.groupby(title_hamlet_no_duplicates.year//10*10)
hamlet_decade.size()

year
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    2
dtype: int64

#### Question 2
##### part 5
 here we are making a new data frame for all n that equals 1.(main carector) 
<br> here we are taking the data frame from befor and making it that the year that the movies come out are btween 1950 and 1959.
<br> than we are goona make the data frame be for only actors/actresses
<br> next we will groupby the year
<br> and print out the size of each group that will tell us how many actors/actresses were the lead in movies per year.

In [18]:
lead_role=cast.loc[cast['n']==1]
lead_role_50s=lead_role.loc[lead_role['year']>1949].loc[lead_role['year']<1960]
actor=lead_role_50s.loc[lead_role_50s['type']=='actor']
actor_grouped=actor.groupby('year')
print("actor")
print(actor_grouped.size())
actress=lead_role_50s.loc[lead_role_50s['type']=='actress']
actress_grouped=actress.groupby('year')
print()
print("actress")
print(actress_grouped.size())

actor
year
1950    604
1951    633
1952    591
1953    634
1954    626
1955    606
1956    614
1957    708
1958    694
1959    678
dtype: int64

actress
year
1950    271
1951    272
1952    284
1953    290
1954    298
1955    264
1956    288
1957    284
1958    275
1959    287
dtype: int64

#### Question 2
##### part 6
 I will take the data frame that has all the lead acters and make it be from the year 1990.
<br> than i will make in order of the actors with most lead roles to the actors with least lead roles. and show the top 10 acters.

In [19]:
lead_role_90s=lead_role.loc[lead_role['year']>1989]
lead_role_90s['name'].value_counts().head(10)

Mohanlal              126
Mammootty             118
Akshay Kumar           87
Jayaram                76
Andy Lau               72
Ajay Devgn             69
Eric Roberts           68
Amitabh Bachchan       68
Nagarjuna Akkineni     60
Dilip                  59
Name: name, dtype: int64

#### Question 2
#### part 7
I will make a data frame with all the rows with actor Frank oz.
<br> I will sort the rows by order of the year from earliest to latest.
<br>than i groupedby the year and title so that it is in order of the year. than i calle d it size.
<br> if the size is bigger than 1 it will print

In [20]:
frank_oz=cast.loc[cast['name']=="Frank Oz"]
frank_oz_sort=frank_oz.sort_values('year', ascending=True)
frank_oz_grouped=frank_oz_sort.groupby(['year','title']).size()
frank_oz_grouped[frank_oz_grouped>1]

year  title
1979  The Muppet Movie                            8
1981  An American Werewolf in London              2
      The Great Muppet Caper                      6
1982  The Dark Crystal                            2
1984  The Muppets Take Manhattan                  7
1985  Sesame Street Presents: Follow that Bird    3
1992  The Muppet Christmas Carol                  7
1996  Muppet Treasure Island                      4
1999  Muppets from Space                          4
      The Adventures of Elmo in Grouchland        3
dtype: int64